/* SPDX-License-Identifier: AGPL-3.0-only */
/* SPDX-FileCopyrightText: 2025-2026 Yurii Arkhanhelskyi */
/* Описания доступа, которые ПОКАЗЫВАЕТ СИСТЕМА.
   Не переводы интерфейса: эти строки читает macOS в своём окне запроса,
   и язык там — системный, а не выбранный в настройках приложения.
   Правится вместе с macos/Runner/Info.plist: ключ, которого нет здесь,
   система покажет на языке разработки. */

"NSMicrophoneUsageDescription" = "O Secretly usa o microfone para chamadas de voz e vídeo e para gravar mensagens de voz.";
"NSCameraUsageDescription" = "O Secretly usa a câmera para videochamadas e para ler QR codes de vinculação de dispositivos.";
"NSPhotoLibraryUsageDescription" = "O Secretly acessa suas fotos para enviar imagens nas conversas.";
"NSDocumentsFolderUsageDescription" = "O Secretly acessa a pasta Documentos para enviar arquivos nas conversas.";
"NSDownloadsFolderUsageDescription" = "O Secretly acessa a pasta Downloads para salvar arquivos das conversas.";
"NSDesktopFolderUsageDescription" = "O Secretly acessa a Área de Trabalho para enviar arquivos e capturas de tela.";
"NSAppleEventsUsageDescription" = "O Secretly usa os Apple Events para integração com as notificações do sistema.";
